{
  "pt": {
    "title": "Front-end Developer e Psicólogo",
    "p1": "Há tempos atrás, entrei na universidade em Ciências da Computação, no segundo ano, uma cadeira opcional de psicologia virou a minha vida noutra direção.",
    "p2": "Enventualmente, tornei-me Psicólogo Clínico, mas uma ideia de uma aplicação para disponibilizar aos meus clientes entre sessões e após o final do processo clínico, voltou a virar a Computação na minha direção.",
    "p3": "Decidi ser eu mesmo a construir a aplicação; e um bichinho que há uns anos não existia, desta vez foi diferente - aparentemente gosto de construir coisas!",
    "card1sub": "App android. A funcionalidade principal é completar desafios psicológicos diários, seguir o progresso e ir desbloqueando novo conteúdo.",
    "card2title": "Este site",
    "card2sub": "O objetivo foi construir algo rápido para funcionar como portfólio e aproveitar para usar outras tecnologias que tenho vindo a aprender.",
    "footer": "Desenvolvido por Ricardo Linhares - 2023",
    "modal": "O objetivo da app era criar um sistema de promoção de saúde mental, que permitisse rastrear o progresso feito e cativasse os utilizadores. Era também necessário um método de monetização.<br/><br/> A applicação conta com um sistema de Status tipo RPG, títulos de conquistas, inventário de itens adquiridos, registos de gratidão e meditação, entre outras coisas. A app é freemium, utilizando anúncios e uma opção de compra que permite acesso a funcionalidades exclusivas e desativação de anúncios",
    "modalLink": "Ver no GooglePlay",
    "nav": {
      "sobre": "Sobre mim",
      "projectos": "Projectos",
      "contactos": "contactos"
    },
    "c": {
      "nome": "Nome",
      "nomeplace": "O seu nome",
      "mensagem": "Mensagem",
      "menplace": "Escreva a sua mensagem",
      "send": "Enviar",
      "sending": "a enviar...",
      "mailplace": "exemplo@dominio.com",
      "feedback": "Mensagem enviada com sucesso"
    }
  },
  "en": {
    "title": "Developer and Psychologist",
    "p1": "With a background in Computer Science and Psychology, I am dedicated to creating experiences and solutions that resonate with users.",
    "p2": "I'm committed in improving mental health with tech. I also draw on my free time.",
    "card1sub": "Android app. The main functionality is to complete daily psychological challenges, track progress, and unlock new content.",
    "card2title": "This site",
    "card2sub": "The goal was to quickly build something to serve as a portfolio and to use other technologies I have been learning.",
    "card3title": "A personal drive app",
    "card3sub": "A home web server similar to Google Drive. A easier and quicker way to acess personal files and share them with others.",
    "card4title": "FrenteJS, a library",
    "card4sub": "I wanted to be able to make small interactive apps, without the hassel of messing with bundles and configurations.",
    "footer": "Developed by Ricardo Linhares - 2023",
    "modal": "The goal of this app was to create a mental health improvement system that would track progress and engage users. A monetization method was also needed.<br/><br/> The application features an RPG-style Status system, achievement titles, inventory of acquired items, gratitude and meditation records, among other things. The app is freemium, using ads and a purchase option that provides access to exclusive features and ad removal.",

    "modalLink": "See it on GooglePlay",
    "modal2": "I made this app for personal use. I needed a way to acess my files in other institutions computers without login in to google.<br/>This app backend runs on a raspberry pi with node and express, and uses react with vite on the front. I ended up making acounts for my family to use as well, and a shared folder to make files available to all of us. You can acess it with the credentials 'loginGuest' and 'passwordGuest', although guests can't upload files.",
    "modal2Link":"Go to website",
    "modal3": "This is a small library for writing component-based interactable SPAs using just JavaScript (or TS).<br/><br/>To use it, simply copy a js file from my github to your project. Alternatively, you can clone a TypeScript-Tailwind template, which includes some pre-made components and a presentation app. Check the link below for more details.",
    "modal3Link":"Go to website",
   
    "nav": {
      "sobre": "About me",
      "projectos": "Projects",
      "contactos": "Contacts"
    },
    "c": {
      "nome": "Name",
      "nomeplace": "Your name",
      "mensagem": "Message",
      "menplace": "Write your Message",
      "send": "Send",
      "sending": "sending...",
      "mailplace": "example@domain.com",
      "feedback": "Message successfully sent"
    }
  }
}